from torchvision.transforms import Compose, Resize, ToTensor
import torch

session = torch.jit.load(
    "src/ai/torchscript/food.torchscript")

input_shape = (640, 640)

transformation = Compose([Resize(input_shape), ToTensor()])

labels = ['바베큐', '백숙', '바게트', '반미', '족발', '비빔밥', '삼겹살', '불고기', '분짜', '버거', '부리토', '케이크', '만두', '카프레제', '치킨', '연어', '초콜릿', '츄러스', '커피', '아이스 커피', '쿠키', '크레페', '크로와상', '크로크 무슈', '카레', '다쿠아즈', '딤섬', '도넛', '베이글', '에그 타르트', '라면', '피시 앤 칩스', '퐁듀', '프렌치 프라이', '프렌치 토스트', '갈비', '젤라토', '김밥', '아이스크림', '핫도그', '훠궈', '자장면', '잡채', '토스트', '케밥', '김치찌개', '된장찌개', '라자냐', '랍스터', '마카롱', '마들렌', '마파', '밀푀유', '머핀', '계란', '나쵸', '나시고랭', '오믈렛', '삼각김밥', '팟타이', '파스타', '팬케이크', '빙수', '파이', '피자', '팝콘', '요거트', '돈까스', '푸딩', '김치', '라멘', '라따뚜이', '쌀국수', '리조또', '샐러드', '샌드위치', '사시미', '짬뽕', '미역국', '시리얼', '소바', '와플', '스프', '스테이크', '스시', '타코', '타코야끼', '티라미수', '딸기', '떡볶이', '우동', '두부', '월남쌈']